viys/Configuration/Keil5 MDK/stm32/Keil.STM32F2xx_DFP.1.0.7.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32F2xx_DFP</name>                                                       <!-- name of package -->
  <description>STMicroelectronics STM32F2 Series Device Support, Drivers and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="1.0.7" date="2014-04-29">
      Updated I2C driver  (BUG Fix: 2 byte reception)
      Device:StdPeriph Drivers:Framework Version:1.1.1 - added file misc.c
    </release>
    <release version="1.0.6">
      Added STM Peripheral Library V1.1.0
    </release>
    <release version="1.0.5">
      Updated I2c driver (corrected register access)
      USB Device drivers update: multiple packet read, EP0 unconfiguration
      Updated SPI driver (IRQ handling corrected)
    </release>
    <release version="1.0.4">
      Updated drivers (namespace prefix ARM_ added)
    </release>
    <release version="1.0.3">
      Added STM32F200 Board Support Bundle
    </release>
    <release version="1.0.2">
      Added emWin Example and GUIDemo for MCBSTM32F200
      Added emWin LCD driver for MCBSTM32F200
      Updated USBH Drivers (improved robustness)
    </release>
    <release version="1.0.1">
      Generic Drivers moved to "Drivers" Class
      Added UART and I2C Driver
      Updated USBD and USBH Drivers
      Added MCBSTM32F200 Demo example
      Added MCBSTM32F200 USB Host Keyboard example
      Added MCBSTM32F200 BSP Drivers: Joystick, Touchscreen, Accelerometer, Gyroscope, Camera
      Updated MCBSTM32F200 BSP Driver: Keyboard
      Updated all MCBSTM32F200 examples
      Minor corrections:
      - SPI Driver
      - DMA Driver
      - MCI Driver
    </release>
    <release version="1.0.0">
      First Release version of STM32F2 Device Family Pack.
    </release>
    <release version="0.9.0">
      Beta version of STM32F2 Device Family Pack.
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F2</keyword>
    <keyword>STM32F2xx</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="STM32F2 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <book    name="Documents\dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
        <description>
The STM32F20x family incorporates high-speed embedded memories and an extensive range of enhanced I/Os and peripherals connected to two APB buses, three AHB buses and a 32-bit multi-AHB bus matrix.
Typical applications include Motor drive and application control Medical equipment, Industrial applications: PLC, inverters, circuit breakers, Printers and scanners, Alarm systems, video intercom, and HVAC, Home audio appliances

  - Adaptive real-time memory accelerator (ART)
  - LCD parallel interface, 8080/6800 modes
  - Multi-layer bus matrix
  - 5 V-tolerant I/Os
  - Timer with quadrature (incremental) encoder input
  - Parallel camera interface
  - Analog true random number generator
  - 96-bit unique ID
        </description>

        <feature type="Timer"         n="12"      m="16"/>
        <feature type="Timer"         n="2"       m="32"/>
        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="30000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="4"       m="7500000"/>
        <feature type="UART"          n="2"       m="7500000"/>
        <feature type="USBOTG"        n="1"                           name="USB OTG Full Speed"/>
        <feature type="USBOTG"        n="1"                           name="USB OTG High Speed"/>
        <feature type="CAN"           n="2"/>
        <feature type="SDIO"          n="1"                           name="Secure Digital IO"/>
        <feature type="RNG"           n="1"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>
        <feature type="Temp"          n="-40"     m="85"/>
        <feature type="Temp"          n="-40"     m="105"/>


      <!-- ************************  Subfamily 'STM32F205'  **************************** -->
      <subFamily DsubFamily="STM32F205">
        <feature type="I2C"           n="3"/>
      
      <!-- *************************  Device 'STM32F205RB'  ***************************** -->
      <device Dname="STM32F205RB">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F205RC'  ***************************** -->
      <device Dname="STM32F205RC">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F205RE'  ***************************** -->
      <device Dname="STM32F205RE">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
        <feature type="CSP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F205RF'  ***************************** -->
      <device Dname="STM32F205RF">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F205RG'  ***************************** -->
      <device Dname="STM32F205RG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
        <feature type="CSP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F205VB'  ***************************** -->
      <device Dname="STM32F205VB">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F205VC'  ***************************** -->
      <device Dname="STM32F205VC">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F205VE'  ***************************** -->
      <device Dname="STM32F205VE">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F205VF'  ***************************** -->
      <device Dname="STM32F205VF">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F205VG'  ***************************** -->
      <device Dname="STM32F205VG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F205ZC'  ***************************** -->
      <device Dname="STM32F205ZC">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F205ZE'  ***************************** -->
      <device Dname="STM32F205ZE">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="144"/>
      </device>
      
