viys/Configuration/Keil5 MDK/stm32/Keil.STM32F2xx_DFP.1.0.7.pdsc
      <!-- *************************  Device 'STM32F207IG'  ***************************** -->
      <device Dname="STM32F207IG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="140"/>
        <feature type="QFP"           n="176"/>
        <feature type="BGA"           n="176"/>
      </device>
      
      <!-- *************************  Device 'STM32F207VC'  ***************************** -->
      <device Dname="STM32F207VC">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F207VE'  ***************************** -->
      <device Dname="STM32F207VE">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F207VF'  ***************************** -->
      <device Dname="STM32F207VF">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F207VG'  ***************************** -->
      <device Dname="STM32F207VG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F207ZC'  ***************************** -->
      <device Dname="STM32F207ZC">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F207ZE'  ***************************** -->
      <device Dname="STM32F207ZE">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="140"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F207ZF'  ***************************** -->
      <device Dname="STM32F207ZF">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F207ZG'  ***************************** -->
      <device Dname="STM32F207ZG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F20x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F20x_DS.PDF"                title="STM32F20x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="QFP"           n="144"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F215'  **************************** -->
      <subFamily DsubFamily="STM32F215">
        <feature type="I2C"           n="3"/>
        <feature type="Crypto"        n="1"                   name="Hardware acceleration for AES 128, 192, 256, Triple DES, HASH (MD5, SHA-1)"/>
      
      <!-- *************************  Device 'STM32F215RE'  ***************************** -->
      <device Dname="STM32F215RE">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F21x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F21x_DS.PDF"                title="STM32F21x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F215RG'  ***************************** -->
      <device Dname="STM32F215RG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F21x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F21x_DS.PDF"                title="STM32F21x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F215VE'  ***************************** -->
      <device Dname="STM32F215VE">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F21x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F21x_DS.PDF"                title="STM32F21x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F215VG'  ***************************** -->
      <device Dname="STM32F215VG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F21x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F21x_DS.PDF"                title="STM32F21x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="QFP"           n="100"/>
      </device>
      
