viys/Configuration/Keil5 MDK/stm32/Keil.STM32F2xx_DFP.1.0.7.pdsc
      <!-- *************************  Device 'STM32F217VG'  ***************************** -->
      <device Dname="STM32F217VG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F21x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F21x_DS.PDF"                title="STM32F21x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="82"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F217ZE'  ***************************** -->
      <device Dname="STM32F217ZE">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F21x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F21x_DS.PDF"                title="STM32F21x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F217ZG'  ***************************** -->
      <device Dname="STM32F217ZG">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\STM32F2xx.h"  define="STM32F2XX"/>
        <debug      svd="SVD\STM32F21x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F2xx_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F2xx_OPT.FLM"  start="0x1FFFC000"  size="0x4000"                   default="0"/>
        <algorithm  name="Flash\STM32F2xx_OTP.FLM"  start="0x1FFF7800"  size="0x0210"                   default="0"/>
        <book       name="Documents\STM32F2_RM.PDF"                  title="STM32F2 Series Reference Manual"/>
        <book       name="Documents\STM32F21x_DS.PDF"                title="STM32F21x Data Sheet"/>
        <book       name="Documents\mcbSTM32F200.chm"                title="MCBSTM32F200 User's Guide"/>
        <book       name="http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00022971.pdf"   title="STM3220G-EVAL"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="114"/>
        <feature type="QFP"           n="144"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <boards>
    <board vendor="Keil" name="MCBSTM32F200" revision="Ver 1.1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBSTM32F200=ON">
      <description>Keil MCBSTM32F200 Development Board</description>
      <image small="Images\mcbstm32f200_board_small.jpg" large="Images\mcbstm32f200_board_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcbstm32f200/" title="MCBSTM32F200 Evaluation Board Web Page"/>
      <book category="schematic" name="Documents\mcbstm32f200-schematics.pdf" title="Schematics"/>
      <book category="manual"    name="Documents\mcbstm32f200.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F207IG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F207"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F217"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F205"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F215"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="PWR"             n="8"  m="12"      name="Power jack with Voltage Regulator capable to supply both USB host interfaces"/>
      <feature type="RAM"             n="1"              name="2 MByte SRAM"/>
      <feature type="ROM"             n="1"              name="8 MByte NOR Flash"/>
      <feature type="ROM"             n="1"              name="512 MByte NAND Flash"/>
      <feature type="ROM"             n="1"              name="8 kByte I2C EEPROM"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed, Host/Device, OTG"/>
      <feature type="USB"             n="1"              name="USB 2.0 High Speed, Host/Device, OTG"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Gyro"            n="1"              name="3-axis digital output gyroscope"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Accelerometer"   n="1"              name="3-axis digital Accelerometer"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"          n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="Other"           n="1"              name="Digital Microphone"/>
      <feature type="Camera"          n="1"              name="Digital VGA Camera"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Wakeup, Tamper and User"/>
      <feature type="LED"             n="8"              name="LEDs directly connected to port pins"/>      
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F20x">
      <description>STMicroelectronics STM32F2 Series devices</description>
      <require Dname="STM32F20[57]??"/>
    </condition>
    <condition id="STM32F21x">
      <description>STMicroelectronics STM32F21x Devices</description>
      <require Dname="STM32F21[57]??"/>
    </condition>

    <condition id="STM32F2xx CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>STMicroelectronics STM32F2 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F2????"/>
    </condition>

    <condition id="STM32F2 STDPERIPH">
      <description>STMicroelectronics STM32F2 Standard Peripherals Drivers requirements</description>
      <require condition="STM32F2xx CMSIS Device"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
    </condition>

    <condition id="STM32F2 STDPERIPH RCC">
      <description>STMicroelectronics STM32F2 Standard Peripherals Drivers with RCC</description>
      <require condition="STM32F2 STDPERIPH"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
    </condition>

    <condition id="STM32F21x STDPERIPH RCC">
      <description>STMicroelectronics STM32F2 Standard Peripherals Drivers with RCC</description>
      <require condition="STM32F21x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
    </condition>

    <condition id="STM32F2xx CMSIS GPIO">
      <description>STMicroelectronics STM32F2 Series GPIO Driver with CMSIS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F2????"/>
      <require Cclass ="Device" Cgroup="GPIO" />
    </condition>

