viys/Configuration/Keil5 MDK/stm32/Keil.STM32F2xx_DFP.1.0.7.pdsc
    <condition id="STM32F2xx CMSIS GPIO DMA">
      <description>STMicroelectronics STM32F2 Series GPIO and DMA Driver with CMSIS-CORE</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F2????"/>
      <require Cclass ="Device" Cgroup="GPIO" />
      <require Cclass ="Device" Cgroup="DMA" />
    </condition>

    <condition id="STM32F2xx CMSIS RTOS GPIO">
      <description>STMicroelectronics STM32F2 Series GPIO Driver with CMSIS and RTOS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F2????"/>
      <require Cclass ="Device" Cgroup="GPIO" />
    </condition>

    <condition id="STM32F2xx CMSIS RTOS GPIO DMA">
      <description>STMicroelectronics STM32F2 Series GPIO and DMA Driver with CMSIS and RTOS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F2????"/>
      <require Cclass ="Device" Cgroup="GPIO" />
      <require Cclass ="Device" Cgroup="DMA" />
    </condition>

    <condition id="STM32F2xx CMSIS RTOS I2C">
      <description>STMicroelectronics STM32F2 Series I2C Driver with CMSIS and RTOS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F2????"/>
      <require Cclass ="Drivers" Cgroup="I2C" />
    </condition>
  </conditions>
  
  <examples>
    <!-- MCBSTM32F200 Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Blinky">
      <description>Blinky example</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Demo" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Demo">
      <description>Demo example</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\emWin\Example">
      <description>emWin Graphics simple example</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\emWin\GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\USB\Device\HID" version="1.0.1">
      <description>USB Human Interface Device providing access from PC to board LEDs and push buttons</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\USB\Device\MassStorage" version="1.0.1">
      <description>USB Mass Storage Device using SD/MMC Memory Card or RAM as storage media</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\USB\Device\VirtualCOM" version="1.0.1">
      <description>Bridge between PC USB Virtual COM Port and UART port</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="CDC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Virtual COM</keyword>
      </attributes>
    </example>

    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\USB\Host\MassStorage" version="1.0.1">
      <description>USB Host file manipulation example: create, read, copy, delete files from USB Mass Storage Device and format storage device</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Mass Storage</keyword>
      </attributes>
    </example>

    <example name="USB Host Keyboard" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\USB\Host\Keyboard" version="1.0.1">
      <description>Measure example using USB HID Keyboard as input device</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="Keyboard.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>

    <example name="File System Demo" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\FileSystem\File_Demo" version="1.0.1">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card, NOR/NAND Flash, RAM) and format each drive</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>

    <example name="BSD Client" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\Network\BSD_Client" version="1.0.1">
      <description>Example using BSD sockets to send commands to remote server</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="BSD_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="BSD Server" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\Network\BSD_Server" version="1.0.1">
      <description>Example using BSD sockets to accept commands from remote clients</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="BSD_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="FTP Server" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\Network\FTP_Server" version="1.0.1">
      <description>File Server using FTP protocol with SD/MMC Memory Card as storage media</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>
      </attributes>
    </example>

