viys/Configuration/Keil5 MDK/stm32/Keil.STM32F2xx_DFP.1.0.7.pdsc
    <example name="HTTP Server" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\Network\HTTP_Server" version="1.0.1">
      <description>Compact Web Server with CGI interface</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="SMTP Client" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\Network\SMTP_Client" version="1.0.1">
      <description>Example showing how to compose and send emails</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="SMTP_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SMTP Client"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SMTP</keyword>
      </attributes>
    </example>

    <example name="SNMP Agent" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\Network\SNMP_Agent" version="1.0.1">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>

    <example name="Telnet Server" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32F200\Middleware\Network\Telnet_Server" version="1.0.1">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32F2xx CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32F2 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32F2xx    /* Device Startup for STM32F2 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F2xx_OPT.s"       attr="template"  select="Flash Option Bytes Template"/>
        <file category="source" name="Device\Source\ARM\STM32F2xx_OTP.s"       attr="template"  select="Flash One-Time programmable Template"/>
        
        <file category="header" name="Device\Include\stm32f2xx.h"/>
        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_stm32f2xx.s" attr="config"/>
        <!-- system file -->
        <file category="source" name="Device\Source\system_stm32f2xx.c" attr="config"/>
        <!-- device configuration required by drivers at the moment -->
        <file category="header" name="RTE_Driver\Config\RTE_Device.h" attr="config"/>
      </files>
    </component>

    <!-- START: STMicroelectronics Standard Peripherals Drivers -->

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.1.1" condition="STM32F2 STDPERIPH">
      <description>Standard Peripherals Drivers Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="doc"     name="Device\StdPeriph_Driver\stm32f2xx_stdperiph_lib_um.chm"/>
        <file category="include" name="Device\StdPeriph_Driver\inc\"/>
        <file category="source"  name="Device\StdPeriph_Driver\src\misc.c"/>
        <file category="source"  name="Device\StdPeriph_Driver\templates\stm32f2xx_conf.h" attr="config" version="1.1.0"/>
        <file category="include" name="Device\StdPeriph_Driver\templates\stm32f2xx_it.h"   attr="template" select="Interrupt Service Routines"/>
        <file category="source"  name="Device\StdPeriph_Driver\templates\stm32f2xx_it.c"   attr="template" select="Interrupt Service Routines"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Analog-to-digital converter (ADC) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_adc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_adc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Controller area network (CAN) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_can.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_can.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.1.0" condition="STM32F2 STDPERIPH ">
      <description>CRC calculation unit (CRC) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_crc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_crc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRYP" Cversion="1.1.0" condition="STM32F21x STDPERIPH RCC">
      <description>Cryptographic processor (CRYP) driver for STM32F21x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRYP
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_cryp.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_cryp.c"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_cryp_aes.c"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_cryp_des.c"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_cryp_tdes.c"/>
      </files>
    </component>

