viys/Configuration/Keil5 MDK/stm32/Keil.STM32F2xx_DFP.1.0.7.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Digital-to-analog converter (DAC) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_dac.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_dac.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.1.0" condition="STM32F2 STDPERIPH">
      <description>MCU debug component (DBGMCU) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBGMCU
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_dbgmcu.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_dbgmcu.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DCMI" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Digital camera interface (DCMI) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DCMI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_dcmi.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_dcmi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>DMA controller (DMA) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_dma.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_dma.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EXTI" Cversion="1.1.0" condition="STM32F2 STDPERIPH">
      <description>External interrupt/event controller (EXTI) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_exti.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_exti.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Flash" Cversion="1.1.0" condition="STM32F2 STDPERIPH">
      <description>Embedded Flash memory driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_flash.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_flash.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FSMC" Cversion="1.1.0" condition="STM32F21x STDPERIPH RCC">
      <description>Flexible Static Memory Controller (FSMC) driver for STM32F21x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FSMC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_fsmc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_fsmc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>General-purpose I/O (GPIO) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_gpio.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_gpio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="HASH" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Hash processor (HASH) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_HASH
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_hash.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_hash.c"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_hash_md5.c"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_hash_sha1.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Inter-integrated circuit (I2C) interface driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_i2c.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_i2c.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDG" Cversion="1.1.0" condition="STM32F2 STDPERIPH ">
      <description>Independent watchdog (IWDG) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_iwdg.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_iwdg.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PWR" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Power controller (PWR) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_pwr.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_pwr.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC" Cversion="1.1.0" condition="STM32F2 STDPERIPH">
      <description>Reset and clock control (RCC) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_rcc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_rcc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RNG" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Random number generator (RNG) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RNG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_rng.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_rng.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.1.0" condition="STM32F2 STDPERIPH">
      <description>Real-time clock (RTC) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_rtc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_rtc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Secure digital (SDIO) interface driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_sdio.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_sdio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Serial peripheral interface (SPI) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_spi.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_spi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SYSCFG" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>System configuration controller (SYSCFG) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SYSCFG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_syscfg.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_syscfg.c"/>
      </files>
    </component>

