viys/Configuration/Keil5 MDK/stm32/Keil.STM32F2xx_DFP.1.0.7.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIM" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Timers (TIM) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_tim.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_tim.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_usart.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_usart.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG" Cversion="1.1.0" condition="STM32F2 STDPERIPH RCC">
      <description>Window watchdog (WWDG) driver for STM32F2xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f2xx_wwdg.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f2xx_wwdg.c"/>
      </files>
    </component>

    <!-- END: STMicroelectronics Standard Peripherals Drivers -->

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0.1" condition="STM32F2xx CMSIS Device">
      <description>GPIO driver used by RTE Drivers for STM32F2 Series</description>
      <files>
        <file category="header" name="RTE_Driver\GPIO_STM32F2xx.h"/>
        <file category="source" name="RTE_Driver\GPIO_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="DMA" Cversion="1.0.0" condition="STM32F2xx CMSIS Device">
      <description>DMA driver used by RTE Drivers for STM32F2 Series</description>
      <files>
        <file category="header" name="RTE_Driver\DMA_STM32F2xx.h"/>
        <file category="source" name="RTE_Driver\DMA_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="EXTI" Cversion="1.0.0" condition="STM32F2xx CMSIS Device">
      <description>EXTI driver used by RTE Drivers for STM32F2 Series</description>
      <files>
        <file category="header" name="RTE_Driver\EXTI_STM32F2xx.h"/>
        <file category="source" name="RTE_Driver\EXTI_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="FSMC" Cversion="1.0.0" condition="STM32F2xx CMSIS Device">
      <description>FSMC driver used by RTE Drivers for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_FSMC                 /* Device FSMC */
      </RTE_Components_h>
      <files>
        <file category="header" name="RTE_Driver\FSMC_STM32F2xx.h"/>
        <file category="source" name="RTE_Driver\FSMC_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="SPI" Cversion="1.03.0" condition="STM32F2xx CMSIS RTOS GPIO DMA">
      <description>SPI Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\SPI_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="UART" Cversion="1.01.0" condition="STM32F2xx CMSIS RTOS GPIO DMA">
      <description>UART Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_UART1               /* Driver UART1 */
        #define RTE_Drivers_UART2               /* Driver UART2 */
        #define RTE_Drivers_UART3               /* Driver UART3 */
        #define RTE_Drivers_UART4               /* Driver UART4 */
        #define RTE_Drivers_UART5               /* Driver UART5 */
        #define RTE_Drivers_UART6               /* Driver UART6 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\UART_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="I2C" Cversion="1.03.0" condition="STM32F2xx CMSIS RTOS GPIO DMA">
      <description>I2C Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\I2C_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="MCI" Cversion="1.01.0" condition="STM32F2xx CMSIS RTOS GPIO DMA">
      <description>MCI Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\MCI_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="Ethernet MAC" Cversion="1.02.0" condition="STM32F2xx CMSIS RTOS GPIO">
      <description>Ethernet MAC Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\EMAC_STM32F2xx.c"/>
      </files>
    </component>

