viys/Configuration/Keil5 MDK/stm32/Keil.STM32F2xx_DFP.1.0.7.pdsc
    <component Cclass="Drivers" Cgroup="USB Device" Csub="Full-speed" Cversion="1.03.0" condition="STM32F2xx CMSIS RTOS GPIO">
      <description>USB Device Full-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\OTG_FS_STM32F2xx.c"/>
        <file category="source" name="RTE_Driver\USBD_FS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB Device" Csub="High-speed" Cversion="1.03.0" condition="STM32F2xx CMSIS RTOS GPIO">
      <description>USB Device High-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\OTG_HS_STM32F2xx.c"/>
        <file category="source" name="RTE_Driver\USBD_HS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB Host" Csub="Full-speed" Cversion="1.03.0" condition="STM32F2xx CMSIS RTOS GPIO">
      <description>USB Host Full-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\OTG_FS_STM32F2xx.c"/>
        <file category="source" name="RTE_Driver\USBH_FS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB Host" Csub="High-speed" Cversion="1.03.0" condition="STM32F2xx CMSIS RTOS GPIO">
      <description>USB Host High-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\OTG_HS_STM32F2xx.c"/>
        <file category="source" name="RTE_Driver\USBH_HS_STM32F2xx.c"/>
      </files>
    </component>
    
    <!-- MCBSTM32F200 Development Board -->
    <bundle Cbundle="MCBSTM32F200" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCBSTM32F200</description>
      <doc>Documents\mcbstm32f200.chm</doc>
      <component Cgroup="MCBSTM32F200" Csub="LED" condition="STM32F2xx CMSIS GPIO">
        <description>LED driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\LED.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\LED.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="Keyboard" condition="STM32F2xx CMSIS GPIO">
        <description>Keyboard driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\Keyboard.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\Keyboard.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="A/D Converter" condition="STM32F2xx CMSIS Device">
        <description>A/D Converter driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\ADC.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\ADC.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="Joystick" condition="STM32F2xx CMSIS RTOS I2C">
        <description>Joystick driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\Joystick.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\Joystick_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="Touchscreen" condition="STM32F2xx CMSIS RTOS I2C">
        <description>Touchscreen driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\Touch.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="Accelerometer" condition="STM32F2xx CMSIS RTOS I2C">
        <description>Accelerometer driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\Accel.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\Accel_LIS3DH.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="Gyroscope" condition="STM32F2xx CMSIS RTOS I2C">
        <description>Gyroscope driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\Gyroscope.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\Gyroscope_L3G4200D.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="Camera" condition="STM32F2xx CMSIS RTOS I2C">
        <description>Camera driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\Camera.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\Camera_OVM7690.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="Graphic LCD" condition="STM32F2xx CMSIS Device">
        <description>Graphic LCD driver for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\Font_6x8_h.h"/>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\Font_16x24_h.h"/>
          <file category="header" name="Boards\Keil\MCBSTM32F200\Common\GLCD.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\GLCD_16bitIF_STM32F2xx.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32F200" Csub="emWin LCD" Cvariant="16-bit IF" condition="STM32F2xx CMSIS Device">
        <description>emWin LCD driver (16-bit Interface) for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCBSTM32F200\Common\LCD_X_16bitIF_STM32F2xx.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
